###############################################################################
# Created by write_sdc
###############################################################################
current_design RAM256
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name CLK -period 16.5000 [get_ports {CLK}]
set_clock_transition 0.1500 [get_clocks {CLK}]
set_clock_uncertainty 0.2500 CLK
set_input_delay 3.3000 -clock [get_clocks {CLK}] -add_delay [get_ports {A0[0]}]
set_input_delay 3.3000 -clock [get_clocks {CLK}] -add_delay [get_ports {A0[1]}]
set_input_delay 3.3000 -clock [get_clocks {CLK}] -add_delay [get_ports {A0[2]}]
set_input_delay 3.3000 -clock [get_clocks {CLK}] -add_delay [get_ports {A0[3]}]
set_input_delay 3.3000 -clock [get_clocks {CLK}] -add_delay [get_ports {A0[4]}]
set_input_delay 3.3000 -clock [get_clocks {CLK}] -add_delay [get_ports {A0[5]}]
set_input_delay 3.3000 -clock [get_clocks {CLK}] -add_delay [get_ports {A0[6]}]
set_input_delay 3.3000 -clock [get_clocks {CLK}] -add_delay [get_ports {A0[7]}]
set_input_delay 3.3000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[0]}]
set_input_delay 3.3000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[10]}]
set_input_delay 3.3000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[11]}]
set_input_delay 3.3000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[12]}]
set_input_delay 3.3000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[13]}]
set_input_delay 3.3000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[14]}]
set_input_delay 3.3000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[15]}]
set_input_delay 3.3000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[1]}]
set_input_delay 3.3000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[2]}]
set_input_delay 3.3000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[3]}]
set_input_delay 3.3000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[4]}]
set_input_delay 3.3000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[5]}]
set_input_delay 3.3000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[6]}]
set_input_delay 3.3000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[7]}]
set_input_delay 3.3000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[8]}]
set_input_delay 3.3000 -clock [get_clocks {CLK}] -add_delay [get_ports {Di0[9]}]
set_input_delay 3.3000 -clock [get_clocks {CLK}] -add_delay [get_ports {EN0}]
set_input_delay 3.3000 -clock [get_clocks {CLK}] -add_delay [get_ports {WE0[0]}]
set_input_delay 3.3000 -clock [get_clocks {CLK}] -add_delay [get_ports {WE0[1]}]
set_output_delay 3.3000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[0]}]
set_output_delay 3.3000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[10]}]
set_output_delay 3.3000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[11]}]
set_output_delay 3.3000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[12]}]
set_output_delay 3.3000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[13]}]
set_output_delay 3.3000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[14]}]
set_output_delay 3.3000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[15]}]
set_output_delay 3.3000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[1]}]
set_output_delay 3.3000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[2]}]
set_output_delay 3.3000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[3]}]
set_output_delay 3.3000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[4]}]
set_output_delay 3.3000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[5]}]
set_output_delay 3.3000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[6]}]
set_output_delay 3.3000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[7]}]
set_output_delay 3.3000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[8]}]
set_output_delay 3.3000 -clock [get_clocks {CLK}] -add_delay [get_ports {Do0[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {Do0[15]}]
set_load -pin_load 0.0334 [get_ports {Do0[14]}]
set_load -pin_load 0.0334 [get_ports {Do0[13]}]
set_load -pin_load 0.0334 [get_ports {Do0[12]}]
set_load -pin_load 0.0334 [get_ports {Do0[11]}]
set_load -pin_load 0.0334 [get_ports {Do0[10]}]
set_load -pin_load 0.0334 [get_ports {Do0[9]}]
set_load -pin_load 0.0334 [get_ports {Do0[8]}]
set_load -pin_load 0.0334 [get_ports {Do0[7]}]
set_load -pin_load 0.0334 [get_ports {Do0[6]}]
set_load -pin_load 0.0334 [get_ports {Do0[5]}]
set_load -pin_load 0.0334 [get_ports {Do0[4]}]
set_load -pin_load 0.0334 [get_ports {Do0[3]}]
set_load -pin_load 0.0334 [get_ports {Do0[2]}]
set_load -pin_load 0.0334 [get_ports {Do0[1]}]
set_load -pin_load 0.0334 [get_ports {Do0[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {CLK}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {EN0}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A0[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A0[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A0[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A0[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A0[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A0[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A0[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {A0[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Di0[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Di0[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Di0[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Di0[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Di0[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Di0[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Di0[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Di0[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Di0[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Di0[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Di0[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Di0[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Di0[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Di0[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Di0[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {Di0[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WE0[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {WE0[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 10.0000 [current_design]
